RIET/src/InformationRegisters/ERPTreatmentAccounts/ERPTreatmentAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ERPTreatmentAccounts</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>CCDAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CCDSubAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AgentAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AgentSubAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ERPTreatment</name>
    <type>
      <types>EnumRef.ТипыЗаказа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/ERPTreatmentAccounts/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		РГСофтКлиентСервер.УстановитьЗначение(Запись.CCDAccount, СокрЛП(Запись.CCDAccount));
		РГСофтКлиентСервер.УстановитьЗначение(Запись.CCDSubAccount, СокрЛП(Запись.CCDSubAccount));
		РГСофтКлиентСервер.УстановитьЗначение(Запись.AgentAccount, СокрЛП(Запись.AgentAccount));
		РГСофтКлиентСервер.УстановитьЗначение(Запись.AgentSubAccount, СокрЛП(Запись.AgentSubAccount));
		
		Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Start date"" is empty!",
				, "Период", "Запись", Отказ);			
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(Запись.ERPTreatment) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""ERP treatment"" is empty!",
				, "ERPTreatment", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.CCDAccount) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""CCD account"" is empty!",
				, "CCDAccount", "Запись", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.AgentAccount) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""Agent account"" is empty!",
				, "AgentAccount", "Запись", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры
